Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# AgentAttachmentFileDetail
source: File, {0:N0} chars
ja_jp: ファイル、{0:N0} 文字
zh_hans: 文件，{0:N0} 字符
zh_hant: 文件，{0:N0} 字符

# AgentAttachmentFileTruncatedDetail
source: File, included first {0:N0} chars
ja_jp: ファイル、先頭 {0:N0} 文字まで含めました
zh_hans: 文件，包含第一个 {0:N0} 字符
zh_hant: 文件，包含第一個 {0:N0} 字符

# AgentAttachmentDocumentPathOnlyDetail
source: Document, path only
ja_jp: 文書、パスのみ含める
zh_hans: 仅文档、路径
zh_hant: 僅文檔、路徑

# AgentPresetButtonTooltip
source: Persona/instruction presets
ja_jp: ペルソナ/指示プリセット
zh_hans: 角色/指令预设
zh_hant: 角色/指令預設

# AgentPresetAddText
source: Add Preset
ja_jp: プリセットを追加
zh_hans: 添加预设
zh_hant: 新增預設

# AgentPresetEditText
source: Edit
ja_jp: 編集
zh_hans: 编辑
zh_hant: 編輯

# AgentPresetDeleteText
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# AgentPresetEmptyText
source: No presets
ja_jp: プリセットなし
zh_hans: 无预设
zh_hant: 無預設

# AgentPresetRemoveTooltip
source: Deselect
ja_jp: 選択解除
zh_hans: 取消选择
zh_hant: 取消選擇

# AgentPresetSavePlaceholder
source: Enter preset name...
ja_jp: プリセット名を入力...
zh_hans: Enter 预设名称...
zh_hant: Enter 預設名稱...

# AgentPresetContentPlaceholder
source: Persona/instruction content...
ja_jp: ペルソナ/指示の内容...
zh_hans: 角色/指令内容...
zh_hant: 角色/指令內容...

# AgentPresetSaveLabel
source: Preset Name
ja_jp: プリセット名
zh_hans: 预设名称
zh_hant: 預設名稱

# AgentPresetContentLabel
source: Persona/Instructions
ja_jp: ペルソナ/指示
zh_hans: 角色/说明
zh_hant: 角色/說明

# AgentPresetSaveAddButton
source: Add
ja_jp: 追加
zh_hans: 添加
zh_hant: 添加

# AgentPresetSaveCancelButton
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# AgentPresetEditTitle
source: Edit Preset
ja_jp: プリセットを編集
zh_hans: 编辑预设
zh_hant: 編輯預設

# AgentPresetEditSaveButton
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# AgentPresetNameEmptyTitle
source: Add Preset Error
ja_jp: プリセット追加エラー
zh_hans: 添加预设错误
zh_hant: 新增預設錯誤

# AgentPresetNameEmptyMessage
source: Please enter a preset name.
ja_jp: プリセット名を入力してください。
zh_hans: 请输入预设名称。
zh_hant: 請輸入預設名稱。

# AgentPresetDuplicateTitle
source: Duplicate Preset
ja_jp: プリセットの重複
zh_hans: 重复预设
zh_hant: 重複預設

# AgentPresetDuplicateMessage
source: A preset with this name already exists. Do you want to overwrite it?
ja_jp: 同じ名前のプリセットが既に存在します。上書きしますか?
zh_hans: 具有此名称的预设已存在。您想覆盖它吗？
zh_hant: 具有此名稱的預設已存在。您想覆蓋它嗎？

# AgentSkillButtonTooltip
source: Skills
ja_jp: スキル
zh_hans: 技能
zh_hant: 技能

# AgentSkillTitle
source: Skills
ja_jp: スキル
zh_hans: 技能
zh_hant: 技能

# AgentSkillEmptyText
source: No installed skills
ja_jp: インストール済みスキルなし
zh_hans: 没有安装技能
zh_hant: 沒有安裝技能

# AgentSkillFilterPlaceholder
source: Search skills...
zh_hant: 搜尋技能...

# AgentSkillFilterEmptyText
source: No matching skills
zh_hant: 沒有相符的技能

# AgentSkillRemoveTooltip
source: Deselect skill
ja_jp: スキルの選択を解除
zh_hans: 取消选择技能
zh_hant: 取消選擇技能

# AgentSkillRefreshTooltip
source: Rescan skill directory
ja_jp: スキルディレクトリを再スキャン
zh_hans: 重新扫描技能目录
zh_hant: 重新掃描技能目錄

# AgentSkillOpenFolderTooltip
source: Open Skills Folder
ja_jp: スキルフォルダーを開く
zh_hans: 打开技能文件夹
zh_hant: 開啟技能資料夾

# AgentSkillChipPrefix
source: Skill:
zh_hans: 技能：
zh_hant: 技能：

# AgentSkillDisplayLabelFormat
source: Skill: {0}
zh_hans: 技能：{0}
zh_hant: 技能：{0}

# ExplorerInsertMarkdownImage
source: Insert Markdown
ja_jp: Markdownを挿入
zh_hans: 插入 Markdown
zh_hant: 插入 Markdown

# ExplorerInsertMarkdownImageErrorTitle
source: Markdown Insert Failed
ja_jp: Markdown挿入失敗
zh_hans: Markdown 插入失败
zh_hant: Markdown 插入失敗

# ExplorerInsertMarkdownImageNoEditor
source: Select a text editor tab to insert the Markdown image.
ja_jp: Markdown画像を挿入するテキスト編集タブを選択してください。
zh_hans: 选择文本编辑器选项卡以插入 Markdown 图像。
zh_hant: 選擇文字編輯器標籤以插入 Markdown 圖像。

# ExplorerSortName
source: Sort: Name
ja_jp: 並べ替え: 名前順
zh_hans: 排序： 名称
zh_hant: 排序： 名稱

# ExplorerSortNewest
source: Sort: Newest Modified
ja_jp: 並べ替え: 更新日時 (新しい順)
zh_hans: 排序：最新修改
zh_hant: 排序：最新修改

# ExplorerSortOldest
source: Sort: Oldest Modified
ja_jp: 並べ替え: 更新日時 (古い順)
zh_hans: 排序：最旧的修改
zh_hant: 排序：最舊的修改

# AgentHistoryTooltip
source: Session History
ja_jp: セッション履歴
zh_hans: 会话历史记录
zh_hant: 會話歷史記錄

# AgentHistoryTitle
source: Session History (Recent 20)
ja_jp: セッション履歴 (最近の20件)
zh_hans: 会话历史记录（最近 20 个）
zh_hant: 會話歷史記錄（最近 20 個）

# AgentDeleteHistoryTooltip
source: Clear All History
ja_jp: すべての履歴を削除
zh_hans: 清除所有历史记录
zh_hant: 清除所有歷史記錄

# AgentHistoryDeleteText
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# AgentHistoryEmptyText
source: No History
ja_jp: 履歴なし
zh_hans: 没有历史记录
zh_hant: 沒有歷史記錄

# AgentHistoryLoadedActivity
source: Session history loaded
ja_jp: セッション履歴がロードされました
zh_hans: 会话历史记录已加载
zh_hant: 會話歷史記錄已載入

# LlmInsertNewTabOutputButtonText
source: New Tab
ja_jp: 新規タブに入力
zh_hans: 新标签页
zh_hant: 新分頁

# LlmInsertNewTabOutputTooltip
source: Insert AI response in a new tab (Selected part only, if selected)
ja_jp: AIの応答を新規タブに入力 (選択された場合は選択部分のみ)
zh_hans: 在新选项卡中插入 AI 响应（仅限所选部分，如果选择）
zh_hant: 在新分頁中插入 AI 回應（僅限所選部分，如果選擇）

# AgentInsertNewTabOutputButtonText
source: New Tab
ja_jp: 新規タブに入力
zh_hans: 新 Tab
zh_hant: 新 Tab

# AgentInsertNewTabOutputTooltip
source: Insert Agent response in a new tab (Selected part only, if selected)
ja_jp: Agentの応答を新規タブに入力 (選択された場合は選択部分のみ)
zh_hans: 在新选项卡中插入 Agent 响应（仅限所选部分，如果选择）
zh_hant: 在新分頁中插入 Agent 回應（僅限所選部分，如果選擇）

# SettingsHomeFolder
source: Home Folder
ja_jp: ホームフォルダ
zh_hans: 主文件夹
zh_hant: 主資料夾

# SettingsHomeFolderPlaceholder
source: C:\Users\...\Documents
zh_hans: C:\用户\...\文档
zh_hant: C:\使用者\...\文檔

# ExplorerHomeFolderTooltip
source: Go to Home Folder
ja_jp: ホームフォルダへ移動
zh_hans: 转到主文件夹
zh_hant: 轉到主資料夾

# OpenExternalViewerTooltip
source: Open in External Viewer
ja_jp: 外部ビューアーで開く
zh_hans: 在外部查看器中打开
zh_hant: 在外部檢視器中開啟

# OpenWithDefaultProgramTooltip
source: Open in Default Program
ja_jp: 既定のプログラムで開く
zh_hans: 用默认程序打开
zh_hant: 用預設程式開啟

# OpenWithDefaultProgramFailedTitle
source: Failed to Open with Default Program
ja_jp: 既定のプログラムで開けませんでした
zh_hans: 无法使用 Default 程序打开
zh_hant: 無法使用 Default 程式開啟

# OpenWithDefaultProgramNoActiveTab
source: There is no active tab to open with the default program.
ja_jp: 既定のプログラムで開くアクティブなタブがありません。
zh_hans: 没有可用默认程序打开的活动选项卡。
zh_hant: 沒有可用預設程式開啟的活動標籤。

# ExternalViewerOpenTitle
source: Open External Viewer
ja_jp: 外部ビューアーを開く
zh_hans: 打开外部查看器
zh_hant: 打開外部檢視器

# ExternalViewerOpenFailedTitle
source: Failed to Open External Viewer
ja_jp: 外部ビューアーを開けませんでした
zh_hans: 无法打开外部查看器
zh_hant: 無法開啟外部檢視器

# ExternalViewerNoActiveTab
source: There is no active tab to open in the external viewer.
ja_jp: 外部ビューアーで開くアクティブなタブがありません。
zh_hans: 外部查看器中没有可打开的活动选项卡。
zh_hant: 外部檢視器中沒有可開啟的活動標籤。

# ExternalViewerPathMissing
source: Set the external viewer path or command alias in Settings > Editor first.
ja_jp: 設定 > エディターで外部ビューアーのパスまたは実行エイリアスを先に指定してください。
zh_hans: 首先在“设置”>“编辑器”中设置外部查看器路径或命令别名。
zh_hant: 首先在「設定」>「編輯器」中設定外部檢視器路徑或指令別名。

# ExternalViewerStartFailedFormat
source: Could not start the external viewer: {0}{1}Shell launch failed: {2}{1}Direct launch failed: {3}
ja_jp: 外部ビューアーを起動できません: {0}{1}Shell 起動失敗: {2}{1}直接起動失敗: {3}
zh_hans: 无法启动外部查看器：{0}{1}Shell 启动失败：{2}{1}直接启动失败：{3}
zh_hant: 無法啟動外部檢視器：{0}{1}Shell 啟動失敗：{2}{1}直接啟動失敗：{3}

# SettingsExternalViewerPath
source: External Viewer Path or Command Alias
ja_jp: 外部ビューアーのパスまたは実行エイリアス
zh_hans: 外部查看器路径或命令别名
zh_hant: 外部檢視器路徑或命令別名

# SettingsExternalViewerPathPlaceholder
source: uviewer or C:\Program Files\Viewer\viewer.exe
ja_jp: uviewer または C:\Program Files\Viewer\viewer.exe
zh_hans: uviewer 或 C:\Program Files\Viewer\viewer.exe
zh_hant: uviewer 或 C:\Program Files\Viewer\viewer.exe

# SettingsExternalViewerArguments
source: External Viewer Arguments
ja_jp: 外部ビューアーのパラメーター
zh_hans: 外部观察者的争论
zh_hant: 外部觀察者的爭論

# SettingsExternalViewerArgumentsPlaceholder
source: e.g., --open {file}
ja_jp: 例: --open {file}
zh_hans: 例如，--open {file}
zh_hant: 例如，--open {file}

# SettingsExternalViewerArgumentsInfo
source: Use {file} where the current file path should be inserted. If {file} is omitted, the file path is added as the last argument.
ja_jp: {file} の位置に現在のファイルパスを挿入します。{file} がない場合、ファイルパスを最後の引数として自動追加します。
zh_hans: 在应插入当前文件路径的位置使用 {file}。如果省略 {file}，则将文件路径添加为最后一个参数。
zh_hant: 在應插入目前檔案路徑的位置使用 {file}。如果省略 {file}，則將檔案路徑新增為最後一個參數。

# SettingsBackupTitle
source: All Settings
ja_jp: すべての設定
zh_hans: 所有设置
zh_hant: 所有設定

# SettingsExportAllButton
source: Export All Settings
ja_jp: すべての設定を書き出し
zh_hans: 导出所有设置
zh_hant: 匯出所有設定

# SettingsImportAllButton
source: Import All Settings
ja_jp: すべての設定を読み込み
zh_hans: 导入所有设置
zh_hant: 導入所有設定

# SettingsBackupDescription
source: Export the entire .TxtAIEditor folder to txtaieditor-setting.zip or import it from a zip file.
ja_jp: .TxtAIEditor フォルダー全体を txtaieditor-setting.zip に書き出すか、zip から読み込みます。
zh_hans: 将整个 .TxtAIEditor 文件夹导出到 txtaieditor-setting.zip 或从 zip 文件导入。
zh_hant: 將整個 .TxtAIEditor 資料夾匯出到 txtaieditor-setting.zip 或從 zip 檔案匯入。

# SettingsBackupPickerUnavailable
source: Could not open the file picker.
ja_jp: ファイル ピッカーを開けません。
zh_hans: 无法打开文件选择器。
zh_hant: 無法開啟文件選擇器。

# SettingsBackupZipFileType
source: ZIP archive
ja_jp: ZIP 圧縮ファイル
zh_hans: ZIP 存档
zh_hant: ZIP 存檔

# SettingsBackupExporting
source: Exporting all settings...
ja_jp: すべての設定を書き出しています...
zh_hans: 正在导出所有设置...
zh_hant: 正在匯出所有設定...

# SettingsBackupExportedFormat
source: All settings were exported: {0}
ja_jp: すべての設定を書き出しました: {0}
zh_hans: 所有设置均已导出：{0}
zh_hant: 所有設定均已匯出：{0}

# SettingsBackupExportFailedFormat
source: Failed to export all settings: {0}
ja_jp: すべての設定を書き出せませんでした: {0}
zh_hans: 无法导出所有设置：{0}
zh_hant: 無法匯出所有設定：{0}

# SettingsBackupImporting
source: Importing all settings...
ja_jp: すべての設定を読み込んでいます...
zh_hans: 正在导入所有设置...
zh_hant: 正在導入所有設定...

# SettingsBackupImported
source: All settings were imported.
ja_jp: すべての設定を読み込みました。
zh_hans: 所有设置均已导入。
zh_hant: 所有設定均已匯入。

# SettingsBackupImportFailedFormat
source: Failed to import all settings: {0}
ja_jp: すべての設定を読み込めませんでした: {0}
zh_hans: 无法导入所有设置：{0}
zh_hant: 無法導入所有設定：{0}

# SettingsBackupImportedTitle
source: Settings Imported
ja_jp: 設定の読み込み完了
zh_hans: 导入的设置
zh_hant: 導入的設定

# SettingsBackupImportedMessage
source: All settings were imported. Current settings were reloaded, and some items may require a restart.
ja_jp: すべての設定を読み込みました。現在の設定は再読み込み済みです。一部の項目は再起動後に反映される場合があります。
zh_hans: 所有设置均已导入。当前设置已重新加载，某些项目可能需要重新启动。
zh_hant: 所有設定均已匯入。目前設定已重新加載，某些項目可能需要重新啟動。

source: OK
zh_hans: 确定
zh_hant: 確定

# LlmErrorInvalidApiKey
source: API Key is invalid. Please check your settings first.
ja_jp: API Key が無効です。設定を先に確認してください。
zh_hans: API Key 无效。请先检查您的设置。
zh_hant: API Key 無效。請先檢查您的設定。

# LlmErrorInvalidApiCredential
source: API Key is invalid. Please check your settings first.
ja_jp: API Keyが無効です。設定を先に確認してください。
zh_hans: API Key 无效。请先检查您的设置。
zh_hant: API Key 無效。請先檢查您的設定。

# LlmErrorEmptyResponse
source: Received an empty response from AI.
ja_jp: AI から空の応答を受信しました。
zh_hans: 收到 AI 的空回复。
zh_hant: 收到 AI 的空回覆。

# OpenAIErrorApiCallFailed
source: OpenAI API call failed ({0}): {1}
ja_jp: OpenAI API 呼び出し失敗 ({0}): {1}
zh_hans: OpenAI API 调用失败 ({0}): {1}
zh_hant: OpenAI API 呼叫失敗 ({0}): {1}

# OpenAIErrorStreamCallFailed
source: OpenAI API streaming call failed ({0}): {1}
ja_jp: OpenAI API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: OpenAI API 流式调用失败 ({0})：{1}
zh_hant: OpenAI API 串流呼叫失敗 ({0})：{1}

# OpenRouterErrorStreamCallFailed
source: OpenRouter API streaming call failed ({0}): {1}
ja_jp: OpenRouter API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: OpenRouter API 流式调用失败 ({0})：{1}
zh_hant: OpenRouter API 串流呼叫失敗 ({0})：{1}

# CerebrasErrorApiCallFailed
source: Cerebras API call failed ({0}): {1}
ja_jp: Cerebras API 呼び出し失敗 ({0}): {1}
zh_hans: Cerebras API 调用失败 ({0}): {1}
zh_hant: Cerebras API 呼叫失敗 ({0}): {1}

# CerebrasErrorStreamCallFailed
source: Cerebras API streaming call failed ({0}): {1}
ja_jp: Cerebras API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: Cerebras API 流式调用失败 ({0})：{1}
zh_hant: Cerebras API 串流呼叫失敗 ({0})：{1}

# GeminiErrorApiCallFailed
source: Google Gemini API call failed ({0}): {1}
ja_jp: Google Gemini API 呼び出し失敗 ({0}): {1}
zh_hans: Google Gemini API 调用失败 ({0})：{1}
zh_hant: Google Gemini API 呼叫失敗 ({0})：{1}

# GeminiErrorEmptyResponse
source: Received an empty response from Gemini AI.
ja_jp: Gemini AI から空の応答を受信しました。
zh_hans: 收到来自 Gemini AI 的空响应。
zh_hant: 收到來自 Gemini AI 的空響應。

# GeminiErrorStreamCallFailed
source: Google Gemini API streaming call failed ({0}): {1}
ja_jp: Google Gemini API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: Google Gemini API 流式调用失败 ({0})：{1}
zh_hant: Google Gemini API 串流呼叫失敗 ({0})：{1}

# GeminiThinkingFormat
source: [Thinking: {0} tokens]
ja_jp: [思考中: {0} トークン]
zh_hans: 【思考：{0}代币】
zh_hant: 【思考：{0}代幣】

# LmStudioErrorNoModelSelected
source: Please select an LM Studio model first.
ja_jp: LM Studio モデルを先に選択してください。
zh_hans: 请先选择LM Studio型号。
zh_hant: 請先選擇LM Studio型號。

# LmStudioErrorApiCallFailed
source: LM Studio API call failed ({0}): {1}
ja_jp: LM Studio API 呼び出し失敗 ({0}): {1}
zh_hans: LM Studio API 调用失败 ({0}): {1}
zh_hant: LM Studio API 呼叫失敗 ({0}): {1}

# LmStudioErrorEmptyResponse
source: Received an empty response from LM Studio.
ja_jp: LM Studio から空の応答を受信しました。
zh_hans: 收到来自 LM Studio 的空响应。
zh_hant: 收到來自 LM Studio 的空響應。

# LmStudioErrorStreamCallFailed
source: LM Studio API streaming call failed ({0}): {1}
ja_jp: LM Studio API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: LM Studio API 流式调用失败 ({0})：{1}
zh_hant: LM Studio API 串流呼叫失敗 ({0})：{1}

# OllamaErrorNoModelSelected
source: Please select an Ollama model first.
ja_jp: Ollamaモデルを先に選択してください。
zh_hans: 请先选择Ollama型号。
zh_hant: 請先選擇Ollama型號。

# OllamaErrorStreamCallFailed
source: Ollama API streaming call failed ({0}): {1}
ja_jp: Ollama APIストリーミング呼び出し失敗 ({0}): {1}
zh_hans: Ollama API 流式调用失败 ({0})：{1}
zh_hant: Ollama API 串流呼叫失敗 ({0})：{1}

# OllamaCloudErrorNoModelSelected
source: Please select an Ollama Cloud model first.
ja_jp: Ollama Cloudモデルを先に選択してください。
zh_hans: 请先选择Ollama Cloud型号。
zh_hant: 請先選擇Ollama Cloud型號。

# OllamaCloudErrorStreamCallFailed
source: Ollama Cloud API streaming call failed ({0}): {1}
ja_jp: Ollama Cloud APIストリーミング呼び出し失敗 ({0}): {1}
zh_hans: Ollama Cloud API 流式调用失败 ({0})：{1}
zh_hant: Ollama Cloud API 串流呼叫失敗 ({0})：{1}

# GoErrorApiCallFailed
source: OpenCode Go API call failed ({0}): {1}
ja_jp: OpenCode Go API 呼び出し失敗 ({0}): {1}
zh_hans: OpenCode Go API 调用失败 ({0}): {1}
zh_hant: OpenCode Go API 呼叫失敗 ({0}): {1}

# GoErrorStreamCallFailed
source: OpenCode Go API streaming call failed ({0}): {1}
ja_jp: OpenCode Go API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: OpenCode Go API 流式调用失败 ({0}): {1}
zh_hant: OpenCode Go API 串流呼叫失敗 ({0}): {1}

# GoErrorAnthropicApiCallFailed
source: Anthropic API call failed ({0}): {1}
ja_jp: Anthropic API 呼び出し失敗 ({0}): {1}
zh_hans: Anthropic API 调用失败 ({0}): {1}
zh_hant: Anthropic API 呼叫失敗 ({0}): {1}

# GoErrorAnthropicStreamCallFailed
source: Anthropic API streaming call failed ({0}): {1}
ja_jp: Anthropic API ストリーミング呼び出し失敗 ({0}): {1}
zh_hans: Anthropic API 流式调用失败 ({0})：{1}
zh_hant: Anthropic API 串流呼叫失敗 ({0})：{1}

# LlmErrorNoApiKey
source: Error: The corresponding LLM API Key is not registered in the Credential Manager. Please open Settings and save your API Key first.
ja_jp: エラー: 該当する LLM API Key が資格情報マネージャーに登録されていません。設定を開いて先に API Key を保存してください。
zh_hans: 错误：对应的 LLM API Key 未在 Credential Manager 中注册。请先打开“设置”并保存您的 API Key。
zh_hant: 錯誤：對應的 LLM API Key 未在 Credential Manager 註冊。請先開啟「設定」並儲存您的 API Key。

# LlmErrorNoApiKeyOrToken
source: Error: The corresponding LLM API Key is not registered in Credential Manager. Please open Settings and save the credential first.
ja_jp: エラー: 該当する LLM API Keyが資格情報マネージャーに登録されていません。設定を開いて先に資格情報を保存してください。
zh_hans: 错误：对应的 LLM API Key 未在 Credential Manager 中注册。请先打开“设置”并保存凭据。
zh_hant: 錯誤：對應的 LLM API Key 未在 Credential Manager 註冊。請先開啟“設定”並儲存憑證。

# LlmErrorCommunicationPrefix
source: An AI communication error occurred:
ja_jp: AI通信エラーが発生しました:
zh_hans: AI通讯发生错误：
zh_hant: AI通訊發生錯誤：

# AgentActivityExtractDocumentProgressFormat
source: Extracting document text: {0}%
ja_jp: 文書テキストを抽出中: {0}%
zh_hans: 提取文档文本：{0}%
zh_hant: 提取文檔文字：{0}%

# AgentActivityExtractDocumentFormat
source: Extracting document text: {0}
ja_jp: 文書テキストを抽出中: {0}
zh_hans: 提取文档文本：{0}
zh_hant: 提取文檔文字：{0}

# AgentVerboseExtractDocumentOnly
source: Document text extraction completed
ja_jp: 文書テキストの抽出が完了しました
zh_hans: 已完成文档文本提取
zh_hant: 已完成文件文字擷取

# AgentExtractDocumentEmptyPath
source: extract_document failed: path is empty. Provide a PDF, DOCX, PPTX, XLSX, HWPX, DOC, XLS, or PPT file path.
ja_jp: extract_document 失敗: パスが空です。PDF、DOCX、PPTX、XLSX、HWPX、DOC、XLS、または PPT ファイルのパスを指定してください。
zh_hans: extract_document 失败：路径为空。提供 PDF、DOCX、PPTX、XLSX、HWPX、DOC、XLS 或 PPT 文件路径。
zh_hant: extract_document 失敗：路徑為空。提供 PDF、DOCX、PPTX、XLSX、HWPX、DOC、XLS 或 PPT 檔案路徑。

# AgentExtractDocumentFailedFormat
source: extract_document failed: {0}
ja_jp: extract_document 失敗: {0}
zh_hans: 提取文档失败：{0}
zh_hant: 提取文檔失敗：{0}

# AgentExtractDocumentUnsupportedTypeFormat
source: extract_document failed: unsupported file type '{0}'. Supported types: .pdf, .docx, .pptx, .xlsx, .hwpx, .doc, .xls, .ppt.
ja_jp: extract_document 失敗: サポートされていないファイル形式です: '{0}'。対応形式: .pdf, .docx, .pptx, .xlsx, .hwpx, .doc, .xls, .ppt。
zh_hans: extract_document 失败：不支持的文件类型“{0}”。支持的类型：.pdf、.docx、.pptx、.xlsx、.hwpx、.doc、.xls、.ppt。
zh_hant: extract_document 失敗：不支援的檔案類型「{0}」。支援的類型：.pdf、.docx、.pptx、.xlsx、.hwpx、.doc、.xls、.ppt。

# AgentExtractDocumentReadFailedFormat
source: extract_document failed: could not extract text from {0}: {1}
ja_jp: extract_document 失敗: {0} からテキストを抽出できません: {1}
zh_hans: extract_document 失败：无法从 {0} 中提取文本：{1}
zh_hant: extract_document 失敗：無法從 {0} 擷取文字：{1}

# AgentExtractDocumentNoTextFormat
source: extract_document: no text extracted from {0}. If this is a scanned PDF or image-only document, OCR may be required.
ja_jp: extract_document: {0} からテキストを抽出できませんでした。スキャン PDF または画像のみの文書の場合、OCR が必要な可能性があります。
zh_hans: extract_document：没有从 {0} 中提取文本。如果这是扫描的 PDF 或仅图像文档，可能需要 OCR。
zh_hant: extract_document：沒有從 {0} 提取文字。如果這是掃描的 PDF 或僅影像文檔，則可能需要 OCR。

# AgentExtractDocumentUnchangedPrefix
source: extract_document unchanged:
ja_jp: extract_document 変更なし:
zh_hans: extract_document 不变：
zh_hant: extract_document 不變：

# AgentExtractDocumentUnchangedDetail
source: The output file already contains the extracted text.
ja_jp: 出力ファイルには既に抽出済みのテキストが含まれています。
zh_hans: 输出文件已包含提取的文本。
zh_hant: 輸出檔案已包含提取的文字。

# AgentExtractDocumentSavedPrefix
source: extract_document saved:
ja_jp: extract_document 保存済み:
zh_hans: extract_document 已保存：
zh_hant: extract_document 已儲存：

# AgentExtractDocumentSourcePrefix
source: source:
ja_jp: 元ファイル:
zh_hans: 来源：
zh_hant: 來源：

# AgentExtractDocumentOutputExistsNoteFormat
source: note: requested output existed, so the converted text was saved to a new file instead of overwriting: {0}
ja_jp: 注: 指定された出力ファイルが既に存在するため、上書きせず新しいファイルとして保存しました: {0}
zh_hans: 注意：请求的输出已存在，因此转换后的文本被保存到新文件而不是覆盖：{0}
zh_hant: 注意：請求的輸出已存在，因此轉換後的文字被儲存到新檔案而不是覆蓋：{0}

# AgentStreamToTab
source: Stream to Tab
ja_jp: タブにストリーミング
zh_hans: 串流至 Tab
zh_hant: 串流至 Tab

# ExplorerFilterPlaceholder
source: Filter by name (includes subfolders)...
ja_jp: ファイル名でフィルター (サブフォルダを含む)...
zh_hans: 按名称过滤（包括子文件夹）...
zh_hant: 按名稱過濾（包括子資料夾）...

# ExplorerFilterClearTooltip
source: Clear filter
ja_jp: フィルターをクリア
zh_hans: 清除过滤器
zh_hant: 清除過濾器

# ExplorerFilterResultFormat
source: {0:N0} results
ja_jp: {0:N0}件の結果
zh_hans: {0:N0} 结果
zh_hant: {0:N0} 結果

# ArchiveOpenFailedTitle
source: Failed to open archive
ja_jp: 圧縮ファイルを開けません
zh_hans: 打开压缩文件失败
zh_hant: 開啟壓縮檔失敗

# ArchiveEntryOpenFailedTitle
source: Failed to open archive item
ja_jp: 圧縮ファイル内の項目を開けません
zh_hans: 打开压缩文件内项目失败
zh_hant: 開啟壓縮檔內項目失敗

# ArchiveExplorerReadOnlyMessage
source: Archive contents are read-only.
ja_jp: 圧縮ファイルの中身は読み取り専用です。
zh_hans: 压缩文件内容为只读。
zh_hant: 壓縮檔內容為唯讀。

# OfficeViewerUnsupportedDocument
source: Unsupported Office document.
ja_jp: サポートされていない Office 文書です。
zh_hans: 不受支持的 Office 文档。
zh_hant: 不受支援的 Office 文件。

# OfficeViewerDocxStructureError
source: Could not read the DOCX document structure.
ja_jp: DOCX 文書の構造を読み取れません。
zh_hans: 无法读取 DOCX 文档结构。
zh_hant: 無法讀取 DOCX 文檔結構。

# OfficeViewerHwpxStructureError
source: Could not read the HWPX document structure.
ja_jp: HWPX 文書の構造を読み取れません。
zh_hans: 无法读取 HWPX 文档结构。
zh_hant: 無法讀取 HWPX 文檔結構。

# OfficeViewerPptxStructureError
source: Could not read the PPTX presentation structure.
ja_jp: PPTX プレゼンテーションの構造を読み取れません。
zh_hans: 无法读取 PPTX 演示结构。
zh_hant: 無法讀取 PPTX 演示結構。

# OfficeViewerNoBody
source: No document body to display.
ja_jp: 表示する本文がありません。
zh_hans: 没有可显示的文档正文。
zh_hant: 沒有可顯示的文檔正文。

# OfficeViewerNoContent
source: No content to display.
ja_jp: 表示する内容がありません。
zh_hans: 没有可显示的内容。
zh_hant: 沒有可顯示的內容。

# OfficeViewerNoSlides
source: No slides to display.
ja_jp: 表示するスライドがありません。
zh_hans: 没有可显示的幻灯片。
zh_hant: 沒有可顯示的幻燈片。

# OfficeViewerSlideRenderError
source: Could not render any slides.
ja_jp: 表示するスライドをレンダリングできませんでした。
zh_hans: 无法渲染任何幻灯片。
zh_hant: 無法渲染任何投影片。

# OfficeViewerNoSheets
source: No sheets to display.
ja_jp: 表示するシートがありません。
zh_hans: 没有可显示的工作表。
zh_hant: 沒有可顯示的工作表。

# OfficeViewerEmptySheet
source: Empty sheet.
ja_jp: 空のシートです。
zh_hans: 空表。
zh_hant: 空表。

# OfficeViewerRowsLabel
source: rows
ja_jp: 行
zh_hans: 行
zh_hant: 列

# OfficeViewerColumnsLabel
source: columns
ja_jp: 列
zh_hans: 列
zh_hant: 列

# OfficeViewerFirstRowsShownFormat
source: first {0} shown
ja_jp: 最初の {0} 件を表示
zh_hans: 显示第一个 {0}
zh_hant: 顯示第一個 {0}

# OfficeViewerSheetSelectorLabel
source: Sheet
ja_jp: シート
zh_hans: 板材
zh_hant: 板材

# AgentMcpButtonTooltip
source: MCP Servers
ja_jp: MCP サーバー
zh_hans: MCP 服务器
zh_hant: MCP 伺服器

# AgentMcpAddText
source: Add MCP
ja_jp: MCP 追加
zh_hans: 添加 MCP
zh_hant: 加入 MCP

# AgentMcpEmptyText
source: No MCP servers
ja_jp: 登録済み MCP なし
zh_hans: 没有 MCP 服务器
zh_hant: 沒有 MCP 伺服器

# AgentMcpDeleteText
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# AgentMcpEditText
source: Edit
ja_jp: 編集
zh_hans: 编辑
zh_hant: 編輯

# AgentMcpNamePlaceholder
source: Enter MCP name...
ja_jp: MCP 名を入力...
zh_hans: Enter MCP 名称...
zh_hant: Enter MCP 名稱...

# AgentMcpNameLabel
source: MCP Name
ja_jp: MCP 名
zh_hans: MCP 名称
zh_hant: MCP 名稱

# AgentMcpEndpointLabel
source: MCP Address
ja_jp: MCP アドレス
zh_hans: MCP 地址
zh_hant: MCP 位址

# AgentMcpTransportLabel
source: Transport
zh_hans: 连接方式
zh_hant: 連線方式

# AgentMcpTransportStdio
source: stdio (local process)
zh_hans: stdio（本地进程）
zh_hant: stdio（本機處理程序）

# AgentMcpCommandLabel
source: Command (full command line supported)
zh_hans: 执行命令（支持完整命令行）
zh_hant: 執行命令（支援完整命令列）

# AgentMcpArgumentsLabel
source: Server arguments (JSON array)
zh_hans: 参数（JSON 数组）
zh_hant: 伺服器引數（JSON 陣列）

# AgentMcpWorkingDirectoryLabel
source: Process working directory (cwd, optional)
zh_hans: 工作目录（可选）
zh_hant: 處理程序工作目錄（cwd，選用）

# AgentMcpWorkingDirectoryPlaceholder
source: Runs in the current workspace when empty
zh_hans: 留空时使用当前工作区
zh_hant: 留空時在目前工作區中執行

# AgentMcpTargetDirectoryLabel
source: Server target folder (optional)
zh_hant: 伺服器目標資料夾（選用）

# AgentMcpTargetDirectoryPlaceholder
source: Folder used by memory, filesystem, and similar servers
zh_hant: memory、filesystem 等伺服器使用的資料夾

# AgentMcpEnvironmentLabel
source: Environment variables (optional JSON object)
zh_hans: 环境变量（可选 JSON 对象）
zh_hant: 環境變數（選用 JSON 物件）

# AgentMcpStdioInfo
source: If Command contains the full command line, leave Server arguments as []. cwd is the process launch location. The target folder becomes memory.jsonl for the memory server and the final positional argument for other servers.
zh_hans: 命令将作为本地进程运行。示例：npx 与 ["-y", "@modelcontextprotocol/server-filesystem", "D:\\workspace"]
zh_hant: 如果命令已填入完整命令列，請將伺服器引數保留為 []。cwd 是處理程序啟動位置。目標資料夾在 memory 伺服器中對應為 memory.jsonl，在其他伺服器中作為最後一個位置引數傳遞。

# AgentMcpHeaderNameLabel
source: API Key Header Name
ja_jp: API Key ヘッダー名
zh_hans: API Key 标头名称
zh_hant: API Key 標頭名稱

# AgentMcpHeaderNamePlaceholder
source: Authorization
zh_hans: 授权
zh_hant: 授權

# AgentMcpApiKeyInfo
source: API keys are stored in Windows Credential Manager, not in the MCP settings file.
ja_jp: API Key は MCP 設定ファイルには保存せず、Windows 資格情報マネージャーに保存します。
zh_hans: API 密钥存储在 Windows Credential Manager 中，而不是存储在 MCP 设置文件中。
zh_hant: API 金鑰儲存在 Windows Credential Manager 中，而不是儲存在 MCP 設定檔中。
